app/views/admin/items/_form.html.erb

SELECT "genres".* FROM "genres"
---
  <%= f.label :ジャンル %><br>
  <%= f.collection_select(:genre_id, Genre.all, :id, :name) %><br>