app/views/admin/items/index.html.erb

	        <div class="col-4">
	          <%= f.collection_select(:genre_id, Genre.all, :id, :name, include_blank: true) %>
---
SELECT "genres".* FROM "genres"