app/controllers/admin/artists_controller.rb

	def create
		@artist = Artist.new(artist_params)
		@artist.save
---
INSERT INTO "artists" ("name", "description", "artist_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "aaaaaa"], ["description", ""], ["artist_image_id", nil], ["created_at", "2018-08-23 03:09:20.943345"], ["updated_at", "2018-08-23 03:09:20.943345"]]