app/controllers/admin/items_controller.rb

	def create
		@item = Item.new(item_params)
		@artist = Artist.find_by(name: item_params[:artist_name])
		@item.artist_id = @artist.id
		@label = Label.find_by(name: item_params[:label_name])
		@item.label_id = @label.id
	  @item.save
---
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", "aaaaaa"], ["LIMIT", 1]]
SELECT  "labels".* FROM "labels" WHERE "labels"."name" = ? LIMIT ?  [["name", "aaaaa"], ["LIMIT", 1]]
INSERT INTO "items" ("artist_id", "label_id", "title", "price", "stock", "created_at", "updated_at", "status", "item_image_id", "artist_name", "label_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)