app/controllers/admin/labels_controller.rb

SELECT "labels".* FROM "labels"
---
	def index
		@labels = Label.all

INSERT INTO "labels" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "aaaaa"], ["created_at", "2018-08-23 03:09:41.338062"], ["updated_at", "2018-08-23 03:09:41.338062"]]
---
	def create
		@label = Label.new(label_params)
		@label.save