app/controllers/user/carts_controller.rb

  def destroy
    @cart.destroy!
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 1]]

  def find_cart
    if user_signed_in?
      @cart = current_user.carts.find(params[:id])
---
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]