app/controllers/user/carts_controller.rb

	def create
    @cart = Cart.find_by(user_id: current_user)
		item = Item.find(params[:id])
		#@cart_item = @cart.add_item(item.id)
		@cart_items = @cart.cart_items
    if CartItem.exists?(item_id: item.id)
      @cart_item = CartItem.where(item_id: item.id)
            binding.pry
      @cart_item.quantity += 1
      @cart_item.update
      redirect_to user_items_path, notice: 'カートに商品が追加されました。'
    else
      @cart_item = CartItem.new(cart_id: @cart.id,item_id: item.id, quantity: 1)
      if @cart_item.save
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "quantity" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 2], ["updated_at", "2018-08-23 04:13:45.500352"], ["id", 1]]
INSERT INTO "carts" ("user_id", "created_at", "updated_at", "item_id", "quantity") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["created_at", "2018-08-23 04:06:21.249539"], ["updated_at", "2018-08-23 04:06:21.249539"], ["item_id", 1], ["quantity", 1]]

  	def show
      	@cart = Cart.find(params[:id])
      	@cart_items = CartItem.where(cart_id: @cart.id)
  		#@carts = current_cart
  		#@item = item.find(params[:item_id])
		#@cart_item = @cart.cart_items.

    	# @cart_item.quantity += params[:quantity].to_i
    	@cart.cart_items.each do |cart_item|
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]