app/controllers/user/items_controller.rb

SELECT "items".* FROM "items"
---
	def index
      @items = Item.search(params[:search])