app/controllers/user/orders_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]
---
	def new
    @cart = current_cart
      if @cart.cart_items.empty?

INSERT INTO "orders" ("address", "payment_method", "created_at", "updated_at", "user_id", "item_amount") VALUES (?, ?, ?, ?, ?, ?)  [["address", ""], ["payment_method", ""], ["created_at", "2018-08-23 08:27:13.202711"], ["updated_at", "2018-08-23 08:27:13.202711"], ["user_id", 2], ["item_amount", 0]]
DELETE FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]
---
 def create
    @order = Order.new(order_params)
    @order.add_items(current_cart)


      if @order.save
        Cart.destroy(session[:cart_id])