app/controllers/user/orders_controller.rb

  def complete
    if params[:cart_session_id]
      @order = Order.find_by(cart_session_id: params[:cart_session_id])
      raise ActiveRecord::RecordNotFound if @order.nil?
    else
      @order = current_user.orders.find_by(id: params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? AND "orders"."id" IS NULL LIMIT ?  [["user_id", 2], ["LIMIT", 1]]