app/models/cart.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = ? AND "carts"."item_id" = ? LIMIT ?  [["user_id", 3], ["item_id", 2], ["LIMIT", 1]]
UPDATE "carts" SET "quantity" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 6], ["updated_at", "2018-08-25 05:37:30.185390"], ["id", 9]]
---
  def self.add_item(item_id, user)
    cart = Cart.find_or_initialize_by(user: user, item_id: item_id)
    cart.quantity += 1
    cart.save! && cart

INSERT INTO "carts" ("user_id", "created_at", "updated_at", "item_id", "quantity") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["created_at", "2018-08-23 04:06:21.249539"], ["updated_at", "2018-08-23 04:06:21.249539"], ["item_id", 1], ["quantity", 1]]
UPDATE "carts" SET "quantity" = ?, "updated_at" = ? WHERE "carts"."id" = ?  [["quantity", 4], ["updated_at", "2018-08-23 06:04:32.258785"], ["id", 2]]
---
  def update_quantity(quantity)
    self.quantity = quantity
    if self.item_error.present?
      false
    else
      self.save!

SELECT SUM("carts"."quantity") FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]
---
  def self.current_quantity(user)
    Cart.search(user)&.sum(:quantity) || 0

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]
---
  def self.current_amount(user)
    amount = 0
    Cart.search(user)&.each do |cart|