app/models/order.rb

  def new_order(stripe_token = nil)
    set_amount
    set_current_item_info
    set_sales_quantity
    self.save!
---
INSERT INTO "orders" ("address", "payment_method", "created_at", "updated_at", "user_id", "item_amount") VALUES (?, ?, ?, ?, ?, ?)  [["address", ""], ["payment_method", ""], ["created_at", "2018-08-25 03:32:02.499150"], ["updated_at", "2018-08-25 03:32:02.499150"], ["user_id", 3], ["item_amount", 0]]

  def build_history_from_cart

    Cart.includes(:item).search(self.user).each do |cart|
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]

  def cart_clear
    Cart.search(self.user).delete_all
---
DELETE FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]