app/models/order.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]
SELECT "items".* FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
  def build_order_history_from_cart
    self.order_histories = []
    Cart.includes(:item).search(self.user).each do |cart|
      self.order_histories.build(
          item_id: cart.item.id,
          price: cart.item.price,
          quantity: cart.quantity
      )

INSERT INTO "orders" ("address", "payment_method", "created_at", "updated_at", "user_id", "item_amount") VALUES (?, ?, ?, ?, ?, ?)  [["address", ""], ["payment_method", ""], ["created_at", "2018-08-25 07:20:48.376174"], ["updated_at", "2018-08-25 07:20:48.376174"], ["user_id", 3], ["item_amount", 1000]]
---
  def new_order
    set_amount
    set_current_item_info
    set_sales_quantity
    set_stock
    self.save!

UPDATE "items" SET "sales_quantity" = COALESCE("sales_quantity", 0) + 1 WHERE "items"."id" = ?  [["id", 3]]
---
  def set_sales_quantity
    self.order_histories.each do |order_history|
      order_history.item.increment!(:sales_quantity, 1 * order_history.quantity)

UPDATE "items" SET "stock" = COALESCE("stock", 0) - 1 WHERE "items"."id" = ?  [["id", 3]]
---
  def set_stock
    self.order_histories.each do |order_history|
      order_history.item.increment!(:stock, -1 * order_history.quantity)

DELETE FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 3]]
---
  def cart_clear
    Cart.search(self.user).delete_all